Repository: Clean-Reader/CleanReader.Desktop
Catalog: src/Models/Models.Resources/*/Resources.resw
Source language: en_us
Languages: zh_cn

# About
source: About Clean Reader
zh_cn: 关于干净阅读

source: Add
zh_cn: 添加

source: Add book
zh_cn: 添加书籍

# AddToShelf
source: Add to bookshelf
zh_cn: 加入书架

source: All
zh_cn: 全部

# AllBookSources
source: All sources
zh_cn: 全部书源

# AppDescription
source: You can get content from the Internet, you can also read local TXT, EPUB books
zh_cn: 既可以从网络获取内容，也可以阅读本地TXT，EPUB书籍

# AppLanguage
source: Application language
zh_cn: 应用语言

# AppLanguageDescription
source: Select the interface language that the app will use, and it will take effect after restarting the app.
zh_cn: 选择应用将使用的界面语言，重启应用后生效

source: Application theme
zh_cn: 应用主题

# ApplicationThemeDescription
source: Choose which app theme to display
zh_cn: 选择要显示的应用主题

# AppName
source: Clean Reader
zh_cn: 干净阅读

# AppShouldUpdate
source: This library was created by a later version of the app, you need to upgrade your app before accessing it
zh_cn: 该书库由更高版本的应用创建，访问之前您需要先升级您的应用

source: Author
zh_cn: 作者

source: Back
zh_cn: 返回

source: Background
zh_cn: 背景色

# BackToShelf
source: Back to bookshelf
zh_cn: 返回书架

source: Book information
zh_cn: 书籍信息

# BookInformationDescription
source: You can view or modify the metadata of the book here, after clicking save, your modifications will be recorded in the database
zh_cn: 您可以在这里查看或修改书籍的元数据，点击保存后，您的修改将会被记录在数据库中

source: Book name
zh_cn: 书名

# BookNameInputTip
source: Please enter the title/author
zh_cn: 请输入书名/作者

# BookNotExist
source: The book file does not exist or broken, you can go back to the shelf to remove the book entry and re-import
zh_cn: 书籍文件不存在或已损坏，您可以返回书架后移除书籍条目并重新导入

# BookSourceDoc
source: Book source document
zh_cn: 书源文档

source: Book source management
zh_cn: 书源管理

source: Book source name
zh_cn: 书源名

# BookSyncProgress
source: Books synced: {0}/{1}
zh_cn: 已同步书籍：{0}/{1}

source: Cancel
zh_cn: 取消

# CanNotAccessLibrary
source: Failed to access the library, please make sure you have turned on the file system access permission of the application
zh_cn: 访问书库失败，请确保你已经打开了应用的文件系统访问权限

source: Catalog
zh_cn: 目录

# ChapterDownloadingProgress
source: Downloading chapter {0}/{1} ...
zh_cn: 正在下载章节 {0}/{1} ...

# ChapterSplitDescription
source: For TXT books, the application provides a default expression to split chapters. If the results below do not meet your needs, you can customize regular expressions to split chapters
zh_cn: 对于 TXT 书籍，应用提供默认的表达式来拆分章节。如果下面的结果不符合您的需求，您可以自定义正则表达式来拆分章节

# ChapterSplitTitle
source: Chapter split
zh_cn: 章节拆分

# ChooseImportWayDescription
source: You can import books locally, or search for books online from the book source to add
zh_cn: 你可以从本地导入书籍，也可以在线从书源中搜索书籍添加

# ChooseImportWayTitle
source: The way you want to add the book
zh_cn: 选择添加方式

source: Close
zh_cn: 关闭

source: Close library
zh_cn: 关闭书库

source: Color
zh_cn: 颜色

source: Confirm
zh_cn: 确认

source: Continue reading
zh_cn: 继续阅读

# ContinueReadingDescription
source: Continue reading books that were not closed when you last exit app
zh_cn: 继续阅读上次退出时未关闭的书籍

source: Converting and moving file...
zh_cn: 正在转换并移动文件...

source: Copy
zh_cn: 复制

source: Cover url
zh_cn: 封面链接

source: Create
zh_cn: 创建

# CreateBookSource
source: Create new source
zh_cn: 创建书源

# CreateBookSourceDescription
source: Create a new book source with the specified content, after the configuration is complete, the file will be opened with your favorite editor
zh_cn: 创建一个具有指定内容的新书源，配置完成后将会使用您习惯的编辑器打开文件

# CreateLibraryFolderDescription
source: Choose an empty folder, the application will help you with some initialization work. The books you import later will be backed up in the library
zh_cn: 选择一个空文件夹，应用会帮助你进行一些初始化工作。之后您导入的书籍都会在该书库中建立备份

# CreateLibraryFolderTitle
source: Create a new library
zh_cn: 创建新书库

# CreateNewShelf
source: Create a new bookshelf
zh_cn: 创建新书架

# CreateNewShelfTip
source: Create a new bookshelf that cannot have the same name as an existing bookshelf
zh_cn: 创建一个新的书架，该书架不能与现有书架同名

source: Dark
zh_cn: 深色

# DatabaseMigrating
source: Database structure updated, migrating...
zh_cn: 数据库结构更新，正在迁移中...

source: Delete
zh_cn: 删除

# DeleteBookSourceWarning
source: Do you want to delete this book source? Books obtained from this source may not update properly after deletion
zh_cn: 是否要删除该书源？删除后从该书源获取的书籍可能无法正常更新

# DeleteBookWarning
source: Do you want to delete this book? The book will be removed from your library, and the history / notes related to the book will also be deleted
zh_cn: 是否要删除该书籍？ 该书将会从你的书库中被移除，与该书有关的历史记录和笔记也都会被删除

# DeleteShelfWarning
source: Do you want to delete the bookshelf: {0}? Books in the bookshelf will be moved to Uncategorized instead of being deleted
zh_cn: 是否要删除书架 {0} ？书架内的书将会移至未分类而不会被删除

source: Deleting book
zh_cn: 正在删除书籍

source: Description
zh_cn: 描述

# Detail
source: Details
zh_cn: 详情

# DurationEmpty
source: There is no recorded reading data, please check again after reading the book~
zh_cn: 还没有记录的阅读数据，请阅读书籍后再来查看~

# EditAdditionalStyle
source: Edit additional styles
zh_cn: 编辑附加样式

# Explore
source: Discovery & exploration
zh_cn: 探索 & 发现

# ExploreBookAdded
source: A new book has been added, please return to the bookshelf to read
zh_cn: 已添加新书，请返回书架查看

# FailedToDownload
source: Download failed, please try again later
zh_cn: 下载失败，请稍后重试

# FirstReplaceTip
source: Please switch book source to search
zh_cn: 请切换书源以进行搜索

# FirstSearchTip
source: Please enter keywords to find books
zh_cn: 请输入关键词以查找书籍

source: Follow system
zh_cn: 跟随系统

source: Font family
zh_cn: 字体

source: Font size
zh_cn: 字号

source: Foreground
zh_cn: 前景色

source: From google translate
zh_cn: 来自谷歌翻译

source: Full screen
zh_cn: 全屏

# GettingChapters
source: Fetching chapters...
zh_cn: 正在获取章节...

# HasUpdate
source: New version released
zh_cn: 新版本发布

# Help
source: Help & Support
zh_cn: 帮助 & 支持

source: Highlight
zh_cn: 高亮标记

source: Highlight notes
zh_cn: 高亮笔记

source: Hours
zh_cn: 小时

source: Id
zh_cn: 标识符

# IdRepeat
source: Id duplicates with existing book source
zh_cn: Id 与现有的书源重复

# IgnoreVersion
source: Ignore
zh_cn: 忽略该版本

source: Import
zh_cn: 导入

source: Import from local
zh_cn: 从本地导入

# ImportFromLocalTip
source: Support .txt, .epub books
zh_cn: 支持 .txt, .epub 书籍

# InitializeDatabase
source: Data initialization...
zh_cn: 数据初始化中...

source: Interface
zh_cn: 界面

# InternalSearchTip
source: Please enter keywords to search, click the search result to jump to the corresponding page
zh_cn: 请输入关键词进行搜索，点击搜索结果即可跳转到对应页面

source: Invalid file path
zh_cn: 文件路径不可用

# InvalidLibraryPath
source: The library path is unavailable, please select the library again
zh_cn: 书库路径不可用，请重新选择书库

source: Invalid source
zh_cn: 失效书源

# JumpTo
source: Jump
zh_cn: 跳转

# JumpToNotePosition
source: Jump to note location
zh_cn: 跳转到笔记位置

source: Keyword
zh_cn: 关键词

# KeywordPlaceholder
source: Please enter what you are looking for
zh_cn: 请输入要查找的内容

# LanguageRestartTip
source: You need to restart the app to apply the language change
zh_cn: 语言已更改，重启应用后生效

# LastReadTime
source: Last reading time
zh_cn: 最近阅读时间

# LibraryDoNotHaveRequiredFiles
source: The library is damaged and does not contain metadata necessary for the library
zh_cn: 该书库已损坏，不包含书库所必须的元数据

source: Library location
zh_cn: 书库位置

# LibraryLocationDescription
source: You can view or close the current library
zh_cn: 你可以查看或者关闭当前书库

source: Light
zh_cn: 浅色

source: Line height
zh_cn: 行高

# LoadBookFailed
source: Failed to load book
zh_cn: 加载书籍失败

source: Loading online books...
zh_cn: 正在加载网络书籍...

source: Load more
zh_cn: 加载更多

# LoadTocFailed
source: Could not load valid catalog
zh_cn: 无法加载有效的目录

# LocalBook
source: Local books
zh_cn: 本地图书

source: Local path
zh_cn: 本地路径

source: Mini view
zh_cn: 迷你视图

source: Modify
zh_cn: 修改

source: More
zh_cn: 更多

source: Move to top
zh_cn: 置顶

source: Moving file...
zh_cn: 正在移动文件...

source: My book shelf
zh_cn: 我的书架

source: Next chapter
zh_cn: 下一章

# NoDescription
source: No introduction to this book
zh_cn: 此书暂无简介

# NoSelectedOnlineBook
source: No suitable online book was selected
zh_cn: 没有合适的在线书籍被选中

# NoShelf
source: No bookshelf has been created yet~
zh_cn: 还没有创建书架哦~

source: Note
zh_cn: 笔记

# NoteEmpty
source: You haven't taken notes yet~
zh_cn: 你还没有记笔记哟~

# NoteManagement
source: Notes management
zh_cn: 笔记管理

source: Not started
zh_cn: 未开始

# OnlineBook
source: Online books
zh_cn: 在线图书

# OnlineSearch
source: Search online
zh_cn: 在线搜索

source: Open
zh_cn: 打开

# OpenCurrentNotes
source: Open book notes
zh_cn: 打开本书笔记

# OpenDownloadPage
source: Download now
zh_cn: 前往下载

# OpenInBroswer
source: Open in browser
zh_cn: 在浏览器中打开

source: Open library
zh_cn: 打开书库

# OpenLibraryFolderDescription
source: Choose an existing clean reading library, which contains the necessary clean reading metadata files
zh_cn: 选择一个已有的干净阅读书库，其中包含了必要的干净阅读元数据文件

# OpenLibraryFolderTitle
source: Open the library folder
zh_cn: 打开书库文件夹

source: Open settings
zh_cn: 打开设置

source: Open with
zh_cn: 通过其它应用打开

source: Order
zh_cn: 排序

source: Original source
zh_cn: 原书源

source: Personalization
zh_cn: 个性化

# PlaceholderText
source: Everyone is a genius. But if you judge a fish by its ability to climb a tree, it will live its whole life believing that it is stupid.
zh_cn: 鸡蛋因适当的温度而变化为鸡，但温度不能使石头变为鸡

source: pre-release
zh_cn: 预发布

source: Previous chapter
zh_cn: 上一章

source: Read
zh_cn: 阅读

# ReadTime
source: Reading time
zh_cn: 阅读时长

source: Refresh
zh_cn: 刷新

# Regex
source: Regular expression
zh_cn: 正则表达式

source: Reload
zh_cn: 重新加载

source: Replace
zh_cn: 替换

# ReplaceSource
source: Replace book source
zh_cn: 替换书源

# ReplaceSourceDescription
source: Replace the source of the online book with another source, which will re-download the book. It should be noted that although the progress and notes are retained, if the content of the book changes greatly, the progress and notes may deviate
zh_cn: 将该网络书籍的书源替换为其它的书源，这将重新下载书籍。需要注意的是，尽管进度和笔记得以保留，但如果书籍内容变动较大，进度与笔记可能会有偏差

source: Reselect library
zh_cn: 重新选择书库

source: Retry
zh_cn: 重试

source: Save
zh_cn: 保存

source: Search
zh_cn: 搜索

source: Search online
zh_cn: 在线搜索

# SearchOnlineDescription
source: Search for books containing specified keywords from your existing book sources
zh_cn: 从您已有的书源中搜索包含指定关键词的书籍

# SearchOnlineTip
source: Search for books from the book source
zh_cn: 从书源中搜索书籍

# SearchResultIsEmpty
source: No search results containing the specified keywords were found
zh_cn: 没有找到包含指定关键词的搜索结果

# SearchSomething
source: Find what interests you
zh_cn: 找找你感兴趣的内容吧

# SelectionModeOpen
source: Text selection mode is on
zh_cn: 文本选择模式已开启

source: Settings
zh_cn: 设置

source: Share
zh_cn: 分享

# ShelfEmpty
source: There are no designated books in the current bookshelf
zh_cn: 当前书架没有指定的书籍哦~

# ShelfList
source: Bookshelf list
zh_cn: 书架列表

# ShelfManagement
source: Bookshelf management
zh_cn: 书架管理

# ShelfManagementDescription
source: You can create or modify bookshelves here
zh_cn: 你可以在这里新建或修改书架

# ShelfPlaceholder
source: Please enter a shelf name
zh_cn: 请输入书架名称

# ShelfSelection
source: Select bookshelf
zh_cn: 选择书架

# ShelfSelectionDescription
source: You can select an existing bookshelf or create a new one
zh_cn: 你可以选择现有书架或者创建一个新的书架

source: Sign in
zh_cn: 登录

source: Signing in...
zh_cn: 登录中...

source: Smooth scrolling
zh_cn: 平滑滚动

# SortByLastRead
source: Sort by recent reading
zh_cn: 按最近阅读排序

# SortByName
source: Sort by book title
zh_cn: 按书名排序

source: Sort by progress
zh_cn: 按进度排序

source: Sort by time added
zh_cn: 按添加时间排序

source: Sort by type
zh_cn: 按类型排序

# SourceEmpty
source: There are no book sources available in the current application, add one now~
zh_cn: 当前应用没有可用的书源，快添加一个吧！

# SplitChaptersIsEmpty
source: No valid chapters have been split
zh_cn: 没有拆分出有效章节

# SpreadMinWidth
source: Minimum separate reading width
zh_cn: 最小分栏阅读宽度

# SpreadMinWidthDescription
source: After the app window reaches this width, double-column reading will be used
zh_cn: 在应用窗口达到此宽度后，将会使用双栏阅读

# StartupBottomTip
source: The application currently supports TXT, EPUB type local books, and you can customize the book source according to the agreement to obtain online books
zh_cn: 应用目前支持 TXT, EPUB 类型的本地书籍，同时您可以根据协议自定义书源来获取在线书籍

# SupportBookDetail
source: Support for getting book details
zh_cn: 支持获取书籍详情

# SupportChapter
source: Support get catalog
zh_cn: 支持获取目录

# SupportChapterContent
source: Support get chapter content
zh_cn: 支持获取章节内容

# SupportExplore
source: Support discovery module
zh_cn: 支持发现模块

# SupportSearch
source: Support search module
zh_cn: 支持搜索模块

source: Sync
zh_cn: 同步

# TargetFolderShouldEmpty
source: The target folder used to create the library should be an empty folder
zh_cn: 用于创建书库的目标文件夹应该是空文件夹

# ThemeRestartTip
source: The theme has been changed, it will take effect after restarting the app
zh_cn: 主题已更改，重启应用后生效

source: Time ratio
zh_cn: 时长占比

source: Tip
zh_cn: 提示

source: Tools
zh_cn: 工具

source: Total duration
zh_cn: 总阅读时长

# TransferShelf
source: Move to bookshelf
zh_cn: 移至书架

source: Translate
zh_cn: 翻译

# TranslateError
source: Attempt to translate selected statement failed
zh_cn: 尝试翻译选中语句失败

# TranslateResult
source: Translation result
zh_cn: 翻译结果

source: Translating...
zh_cn: 正在翻译...

source: Type
zh_cn: 类型

source: Update
zh_cn: 更新

# UpdateApp
source: Update the app
zh_cn: 更新应用

# UpdateShelf
source: Update bookshelf
zh_cn: 更新书架

# UpdateShelfTip
source: Use new bookshelf name
zh_cn: 使用新的书架名称

source: Version
zh_cn: 版本

# WebUrl
source: Website
zh_cn: 网址

# WelcomeDescription
source: Clean Reader is now designed for Windows 11 and has become a fully localized reader. You can create a library locally or save the library in your cloud folder to obtain cloud synchronization. (OneDrive requires file access permission)
zh_cn: 干净阅读现在为 Windows 11 设计，已成为完全的本地化阅读器，您可以在本地创建书库，或将书库保存在您的云盘中以获得云同步的功能 ( OneDrive 需要打开文件访问权限 )

# WelcomeTitle
source: Welcome to Clean Reader
zh_cn: 欢迎使用干净阅读

source: words
zh_cn: 字
